import fetch from 'node-fetch'
let handler = async (m, { conn }) => {
  let caption = `
╭───[🐈‍⬛]───╮
│╭────────────────────
┴│👋 مرحباً!
⬡│🐈‍⬛\n⬡│ أنا تـيـمـون 🐈‍⬛ *الـقـط الأسـود (🐈‍⬛)*! 
│╰────────────────────
┠───[ معلومات ]────╮
│╭────────────────────
┴│ ( تـيـمـون )
⬡│💻 هو بوت واتساب حديث تم صنعه بواسطة :
⬡│👨‍💻 Alazhar (🇴🇲)
⬡│👩‍💻 Nya (🇾🇪)
⬡│📞 للتواصل معنا, انضم عبر الرابط :
⬡│📌 https://chat.whatsapp.com/CLELmSuuVZaHSq1lOjmXhB
⬡│🙅‍♂️ *( لاتتصل على البوت )*
│╰────────────────────
┠───[ كيف تستخدم البوت ؟ ]────⋆
┴│💡 سوف أعطيكم بعض الأمثلة على كيفية أستخدامه :
⬡│🔸 .منشن \n⬡│- هذا الامر خاص بالمنشن.
⬡│🔸 .طقم \n⬡│- هذا امر مخصوص ل طقم صور الانمي.
⬡│🔸 .ملصق \n⬡│- تحويل الصورة او فيديو إلى ملصق.
┬│🔸 .صورة \n⬡│- هذا امر يطلب اي صورة من جوجل مثال: اكتب .صورة قطة
│╰──────────────
│( البوت تحت الصيانة )
╰────────═┅═───────
*Thank you for choosing Ikratos-MD-v1! 🌟✨*
`.trim()
  m.reply(caption)
}
handler.help = ['alive']
handler.tags = ['bot check']
handler.command = /^(52585688555|٥٦٧٧٧٦٦٥٥٥٥)$/i


export default handler
