import fetch from 'node-fetch'
let handler = async (m, { conn }) => {
  let caption = `
┌─❖
┌─❖ مـرحبـاً ✨🐈‍⬛ 」
└┬❖ 「 ${pushname} 」
││✑「مـعـك تـيـمـون ( 🐈‍⬛) 」◣
││✑「 كـيـف أسـاعـدك ؟ 」◣
│└───────────────┈ ⳹
 「 مـعـلـومـات عـن الـبـوت 」
│✙「 اسـم الـبـوت 」◣ : 「 تـيـمـون ✨🐈‍⬛ 」◣
│✙「 رقـم الـمـالـك 」◣ : ${global.owner}
│✙「عـدد الـمـسـتـخـدمـيـن」◣ : ${Object.keys(global.db.data.users).length}
└┬──────────────┈ ⳹
   │✑  「 اضـغـط عـلـى الـخـيـارات 🐈‍⬛ 」◣
   └───────────────┈ ⳹
%readmore
┏━「 ${botname} 」━━⭓ 
┃╔═✪「 القائمة 」
┃╠الاوامر
┃╠المالك
┃╚═════════════✪
┗━━「 ${pushname} 」━⭓

┏━「 ${botname} 」━━⭓ 
┃╔═✪「 المجموعات 」	        
┃╠المنشن
┃╠المنشن.المخفي
┃╠المتصلين
┃╠الرابط
┃╠اضافة
┃╠ترقية 
┃╠تخفيض
┃╠طرد
┃╠الجروب
┃╠التعديل
┃╚═════════════✪
┗━━「 ${pushname} 」━⭓

┏━「 ${botname} 」━━⭓
┃╔═✪「 الألعاب 」	        
┃╠الاكس او | ttt
┃╠حذف الاكس او | delttt
┃╠الكتابة | كت
┃╠الكتابة | كتت
┃╠الكتابة | كتتت
┃╠بوت اعمل فعالية المارد
┃╚═════════════✪
┗━━「 ${pushname} 」━⭓

┏━「 ${botname} 」━━⭓ 
┃╔═✪「 المالك 」	        
┃╠انضم
┃╠غادر
┃╠حطها.خلفيتك
┃╠عام
┃╠خاص
┃╚═════════════✪
┗━━「 ${pushname} 」━⭓

┏━「 ${botname} 」━━⭓ 
┃╔══✪「 البحث 」	        
┃╠صورة
┃╠فيديو
┃╚═════════════✪
┗━━「 ${pushname} 」━⭓

┏━「 ${botname} 」━━⭓ 
┃╔══✪「 التحويلات 」	        
┃╠ملصق |ستيكر | س
┃╠لصورة
┃╠لفيديو
┃╠لمقطع.صوتي
┃╠لصوتية
┃╠لجيف
┃╚═════════════✪
┗━━「 ${pushname} 」━⭓

┏━「 ${botname} 」━━⭓ 
┃╔═══✪「 البيانات 」	        
┃╠اضافة.رسالة
┃╠قائمة.الرسائل
┃╠حذف.رسالة
┃╚═════════════✪
┗━━「 ${pushname} 」━⭓

┏━「 ${botname} 」━━⭓ 
┃╔══✪「 الاستمارات 」	        
    「 القوانين 」
    「 الترحيب 」
    「 اعلان ترقية | اعلان تخفيض」
    「 استمارة | الاستمارة 」
    「 قائمة الالقاب 」
    「 سؤال 」
    「 امونق اس 」
    「 فعالية التصاميم 」
    「 فعالية الجرس 」
    「 فعالية الديث نوت 」
    「 فعالية الصور 」
    「 فعالية الكراسي 」
    「 فعالية الفرق 」
    「 فعالية القلوب 」
    「 فعالية مين الاسرع 」
    「 فعالية المارد 」
    「 مسابقة 」
    「 مسابقة القنابل 」
    「 بطاقة تغيير صورة الجروب 」
    「 بطاقة تجميع صور 」
    「 بطاقة تغيير القب 」
    「 بطاقة حذف انذار 」
    「 بطاقة سرقة القب 」
    「 بطاقة سخرية 」
    「 بطاقة طرد 」
    「 بطاقة تطهير طرد 」
    「 بطاقة مشرف 」
┃╚═════════════✪
┗━━「 ${pushname} 」━⭓
`.trim()
  m.reply(caption)
}
handler.help = ['alive']
handler.tags = ['bot check']
handler.command = /^(الاوامر|الأوامر)$/i


export default handler
