import fetch from 'node-fetch'
let handler = async (m, { conn }) => {
  let caption = `
╭───[تيمون🐈‍⬛]───╮
│╭────────────────────
┴│👋 مرحبا !
⬡│🤖 انا (تيمون🐈‍⬛) 
⬡│ انا جاهز و اعمل! 🚀
│╰────────────────────
┠───[  معلومات البوت]────╮
│╭────────────────────
┴│(تيمون🐈‍⬛) 
⬡│💻 بوت واتس اب تم إنشاؤه بواسطة:
⬡│👨‍💻 ازهر 🇴🇲
⬡│📞 لأية استفسار تواصل مع
⬡│📱wa.me/96891103640
⬡│🙅‍♂️ لاتتصل
⬡│ ولاسيتم حضرك! 😬
│╰────────────────────
┠───[ كيف تستخدم بعض الاوامر ]────⋆
┴│💡 بعض الاوامر الي يمكنك استخدامها:
⬡│🔸 .الاوامر 
⬡│- يعرض لك قائمة الأوامر المتاحة
⬡│🔸 .تحميل
⬡│- تشغيل مقطع فيديو أو صوت على يوتيوب.
⬡│🔸 .ملصق 
⬡│- يحول لك الصورة إلى ملصق
┬│🔸 .ترجم 
⬡│- يترجم النص إلى لغة اخرى
│╰──────────────
╰────────═┅═───────
*شكرا لاستخدامك (تيمون🐈‍⬛) 🌟✨*
`.trim()
  m.reply(caption)
}
handler.help = ['alive']
handler.tags = ['bot check']
handler.command = /^(6464646464646461661|46646154649454)$/i


export default handler
